import mongoose from "mongoose"

const dialogId = [
  new mongoose.Types.ObjectId(),
  new mongoose.Types.ObjectId(),
  new mongoose.Types.ObjectId(),
]

export const dialog = [
  {
    _id: dialogId[0],
    question: "ไปโซนต่างๆยังไง",
    questionKeyWord: [
      "ไปโซนต่างๆยังไง",
      "มีรถให้บริการสำหรับเดินทางไปโซนต่างๆภายในงานหรือไม่",
      "รถตะลัย",
      "รถตะลัยอยู่ไหน",
      "รถตะลัยเปิดไหม",
    ],
    answer: [
      "คุณสามารถนั่งรถโดยสารสวัสดิการ (รถตะลัย) จากมหาลัยเกษตรศาสตร์ ซึ่งบริการฟรี วิ่งรอบงาน มีทั้งหมด 3 สายให้บริการ ได้แก่ สาย 1 ประตูพหลโยธิน เริ่มจากศาลาหกเหลี่ยม, สาย 3 ประตูพหลโยธิน เริ่มจากศาลาหกเหลี่ยม, สาย 5 เริ่มจากหอพักนิสิต ซอยพหลโยธิน 45 ซึ่งเปิดทุกวัน จันทร์-ศุกร์เวลา 08:00-20:00 เสาร์-อาทิตย์เวลา 08:00-18:00 คุณสามารถตรวจสอบเส้นทางและจุดรอขึ้นเพิ่มเติมได้ทางอินเตอร์เน็ตครับผม",
    ],
  },
  {
    _id: dialogId[1],
    question: "ไปโซนต่างๆของ Metaverse",
    questionKeyWord: [
      "ไปโซนต่างๆของ Metaverse ยังไง",
      "ไปโซนต่างๆของเมตะเวิร์สยังไง",
    ],
    answer: ["โซนต่างๆของ Metaverse จะอยู่ในส่วนต่างๆของ Main map ครับ"],
  },
  {
    _id: dialogId[2],
    question: "ในเมต้าเวิร์สมีกิจกรรมอะไรบ้าง",
    questionKeyWord: [
      "ในเมต้าเวิร์สมีกิจกรรมอะไรบ้าง",
      "เกษตรแฟร์เวิร์สมีอะไรบ้าง",
    ],
    answer: [
      "หลากหลายกิจกรรมมากเลยครับ โดยหลักๆจะเป็นเกมจากโซนต่างๆซึ่งคุณสามารถเล่นมันเพื่อสะสมแต้มไปแลกของรางวัลได้ครับ ขอให้เข้ามาเล่นกันเยอะๆนะครับ",
    ],
  },
]
